# Data Inspection

| Column        | Description                                                                 |
|---------------|-----------------------------------------------------------------------------|
| Title              | The official job title for the position. dataset.                        |
| company            | The name of the company offering the job.                                       |
| location           | The geographic location where the job is based (country, city, or region).                                |
| job_type           | The nature of the job position (e.g., full-time, part-time,contract,internship).                |
| work_mode          | How the job is performed (e.g., onsite, remote, hybrid).                                 |
| Experience_level   | The required level of seniority (e.g., junior, mid-level, senior).                    |
| Experience_year    | The number of years of experience required for the role. |
| categories         | The general job classification or industry (e.g., IT, marketing, finance).    |
| department         | The internal department this role belongs to (e.g., Engineering, Sales, HR).       |
| skills             | A list of required or preferred skills needed to perform the job.      |

In [13]:
import pandas as pd

## Loading Datasets
Load the main jobs dataset and the developers dataset into separate dataframes.

In [14]:
data = pd.read_csv(r"C:\Projects\Project_DM\Wuzzuf\Web_Scrabing\data_jobs.csv")
devolopers = pd.read_csv(r"C:\Projects\Project_DM\Wuzzuf\Web_Scrabing\devolpers.csv")

## Merging Datasets
Concatenate both datasets into a single dataframe and save it as a CSV file.

In [1]:
merged_df = pd.concat([data, devolopers], ignore_index=True)

NameError: name 'pd' is not defined

In [ ]:
merged_df.to_csv("Jobs", index=False)
print("Merged Successfully.")

Merged Successfully.

## Loading Merged Dataset
Read the merged CSV file into a new dataframe for inspection.

In [ ]:
Data_jobs = pd.read_csv(r"C:\Projects\Project_DM\Wuzzuf\Data_Inspection\Jobs")
Data_jobs.head()

,Title,company,location,job_type,work_mode,Experience_level,Experience_year,categories,department,skills
0,Data Scientist with Database Expertise,Confidential,"Riyadh, Saudi Arabia",Full Time,On-site,Experienced,5 - 7 Yrs of Exp,IT/Software Development,Data Science,"['Database Management', 'Python', 'Data Analys..."
1,Data Analyst,Royal Herbs,"Haram, Giza, Egypt",Full Time,On-site,Experienced,3 - 5 Yrs of Exp,Analyst/Research,Analyst/Research,"['Engineering - Telecom/Technology', 'Data Ana..."
2,Data Entry Specialist,El-Dahan Company,"Cairo, Egypt",Full Time,On-site,Entry Level,1 - 3 Yrs of Exp,Administration,Administration,"['Data Entry', 'ERP', 'Microsoft Excel']"
3,Junior Data Analyst,Yodawy,"Mohandessin, Giza, Egypt",Full Time,On-site,Entry Level,1 - 3 Yrs of Exp,Logistics/Supply Chain,Operations/Management,"['Analyst/Research', 'Data Analysis', 'SQL', '..."
4,Data Analytics Specialist,MEAHCO - Saudi German Health,"Katameya, Cairo, Egypt",Full Time,On-site,Experienced,3 - 5 Yrs of Exp,Medical/Healthcare,Quality,"['Analyst/Research', 'SQL', 'python developmen..."

## Displaying Last Rows
Show the last few rows of the merged dataframe to check the data at the bottom.

In [ ]:
Data_jobs.tail()

,Title,company,location,job_type,work_mode,Experience_level,Experience_year,categories,department,skills
10834,"Director of Rooms - Ritz Carlton Amaala, Saudi...",Marriott International,"Riyadh, Saudi Arabia",Full Time,NaN,Manager,Administration,Administration,Sales/Retail,"['administration', 'office management', 'micro..."
10835,Reservation Coordinator/Marketing Administrator,Marriott Vacations Worldwide,"Dubai, United Arab Emirates",Full Time,NaN,Entry Level,Administration,Administration,Sales/Retail,"['administration', 'sales', 'marketing', 'micr..."
10836,HR Officer - Aldar Education,Aldar Education,"Dubai, United Arab Emirates",Full Time,NaN,Entry Level,Administration,Administration,Operations/Management,"['Human Resources (HR)', 'Recruitment', 'Micro..."
10837,AsstDir-Sales I,Marriott International,"Riyadh, Saudi Arabia",Full Time,NaN,Entry Level,Business Development,Business Development,Sales/Retail,"['sales', 'sales skills', 'marketing', 'custom..."
10838,Retail Operations Manager - Watches & Jewelry ...,Glow Beauty on Demand,"Dubai, United Arab Emirates",Full Time,NaN,Experienced,Customer Service/Support,Customer Service/Support,Sales/Retail,"['Operations', 'Management', 'Sales', 'Retail'..."

## Dataset Information
Display summary information about the dataframe including column names, data types, and non-null counts.

In [ ]:
Data_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10839 entries, 0 to 10838
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             10839 non-null  object
 1   company           10839 non-null  object
 2   location          10839 non-null  object
 3   job_type          10839 non-null  object
 4   work_mode         6684 non-null   object
 5   Experience_level  10839 non-null  object
 6   Experience_year   10839 non-null  object
 7   categories        10839 non-null  object
 8   department        10839 non-null  object
 9   skills            10839 non-null  object
dtypes: object(10)
memory usage: 846.9+ KB

## Statistical Summary
Show descriptive statistics for numerical columns in the dataset.

In [ ]:
Data_jobs.describe()

,Title,company,location,job_type,work_mode,Experience_level,Experience_year,categories,department,skills
count,10839,10839,10839,10839,6684,10839,10839,10839,10839,10839
unique,5898,2799,219,7,3,9,171,48,904,7172
top,Accountant,Confidential,"Dubai, United Arab Emirates",Full Time,On-site,Experienced,IT/Software Development,IT/Software Development,Sales/Retail,"['Business Development', 'Sales', 'Sales Skill..."
freq,62,914,2184,10360,5673,6019,905,1725,1473,52

## Inspecting Columns
For each column, print the number of unique values and the number of missing (null) values.

In [ ]:
for col in Data_jobs.columns:
    print(f"Column {col}:")
    print(f"Number of unique values: {len(Data_jobs[col].value_counts())}")
    print(f"Number of null values: {Data_jobs[col].isnull().sum()}")
    print("------------------------------")

Column Title:
Number of unique values: 5898
Number of null values: 0
------------------------------
Column company:
Number of unique values: 2799
Number of null values: 0
------------------------------
Column location:
Number of unique values: 219
Number of null values: 0
------------------------------
Column job_type:
Number of unique values: 7
Number of null values: 0
------------------------------
Column work_mode:
Number of unique values: 3
Number of null values: 4155
------------------------------
Column Experience_level:
Number of unique values: 9
Number of null values: 0
------------------------------
Column Experience_year:
Number of unique values: 171
Number of null values: 0
------------------------------
Column categories:
Number of unique values: 48
Number of null values: 0
------------------------------
Column department:
Number of unique values: 904
Number of null values: 0
------------------------------
Column skills:
Number of unique values: 7172
Number of null values: 0
------------------------------

## Checking for Duplicates
Count the number of duplicate rows in the dataset.

In [ ]:
duplicates = Data_jobs.duplicated().sum()
print(f"Number of duplicates: {duplicates}")

Number of duplicates: 2604

## Identifying Object Features
Select all non-numeric columns (strings) for further analysis.

In [ ]:
object_features = Data_jobs.select_dtypes(include=['object']).columns.tolist() # non-numeric (strings)
object_features

['Title',
 'company',
 'location',
 'job_type',
 'work_mode',
 'Experience_level',
 'Experience_year',
 'categories',
 'department',
 'skills']

## Identifying Numerical Features
Select all numeric columns for further analysis.

In [ ]:
numerical_features = Data_jobs.select_dtypes(include=['int64', 'float64']).columns.tolist()
numerical_features

[]